Revit 2027 API
FormatOptions.GetValidSymbols Method
Overload List
Name | Description
GetValidSymbols() |  Gets the identifiers of all valid symbols for the unit in this FormatOptions.
GetValidSymbols(ForgeTypeId) |  Gets the identifiers of all valid symbols for a given unit.
Top
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace